Revit 2026 API

# FamilyHostingBehavior Enumeration

---

Types of hosts into/onto which a family can be hosted. For informative purposes only. Does not affect anything in Revit!

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum FamilyHostingBehavior
```
```vb
Public Enumeration FamilyHostingBehavior
```
```cpp
public enum class FamilyHostingBehavior
```
```fsharp
type FamilyHostingBehavior
```

| Member name | Value | Description |
| --- | --- | --- |
| Ceiling | 3 |  |
| Face | 5 |  |
| Floor | 2 |  |
| None | 0 |  |
| Roof | 4 |  |
| Wall | 1 |  |

#### Reference

Autodesk.Revit.DB Namespace